Revit 2026 API

# GlazingGlazingColorByObject Property

---

The property labeled "Color By Object" from the "Glazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingColorByObject { get; }
```
```vb
Public Shared ReadOnly Property GlazingColorByObject As String
	Get
```
```cpp
public:
static property String^ GlazingColorByObject {
	String^ get ();
}
```
```fsharp
static member GlazingColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Glazing Class

Autodesk.Revit.DB.Visual Namespace